'''
数据类型:
四种基础数据类型:
int: 数值型数据里的整数数据类型.     ------>处理除小数外的数据
float: 数值型数据里的小数数据类型.   ------>购物,金额,金钱等计算
str: 字符串.                      ------>人机交互
内容一定要包在'',"",''''''.
bool: 布尔类型.(只有两个值0--False和1--True)  ------>判断
程序当中, 最重要的是处理数据.

变量和常量:
常量: 含义和字面量相等,且不能改变. PI=3.141593 
常量名=常量值,使用的时候写常量名即可,常量名一般都是 全大写 .--->PI

变量: 含义和字面量没有对等关系. 含义经常在变.
变量名=变量值,使用的时候写变量名即可, 变量名一般都是 全小写.
age = 18
age = 19
age = 20
java:强类型语言.
int age = 20
python: 弱类型语言. 变量就不强制必须是哪种数据类型, 变量赋值时确定它的数据类型.
age = 22
age = 18
age = 32
变量名是自定义的, 定义规范为:
1.变量名只能以字母或下划线开头, 可以包含数字,字母和下划线.
2.变量起名要起到见名知意.
3.最好不要用python中有特殊含义的关键字或函数名.

数值型数据:
运算符:
+: 
-: 
*:
/:
//: 求商
%:  求余
**: 幂指运算   2**3 = 2的3次方, = 8 --->操作符左边的作为底数,操作符右边的作为指数.
运算的优先级:  ** > /,//,%,* > +, -
()可以改变运算的优先级.

'''
import keyword,random
# age = 18  # age的数据类型是int
# age = 19
# age = 20
# age = 2.0  # age的数据类型是float
# age = '年龄是22' # age的数据类型是字符串
# print(age)
#
# name = True
# print(name)
# print(keyword.kwlist)

# num1 = 15    #int
# num2 = 2.6   #float
# print(num1+num2)  #17.6
# print(num1-num2)  #12.4
# print(num1*num2)  #39.0
# print(num1/num2)  #5.77
# print(num1//num2)  #5
# print(num1%num2)   #2

# num = 3692
# 计算一下这个千位数的个位,十位,百位,千位上的数字
# num = 3692
# num1 = num//1000     #直接除1000取商, 余数为692
# num2 = num%1000//100 #692直接除100取商,余数为92
# num3 = num%100//10   #92直接除10取商, 余数为2
# num4 = num%10        #3692直接除10取余,得到2.
# print("千位,百位,十位,个位为:",num1,num2,num3,num4)

# 中秋抽奖活动:
# 每4单随机免1单,前3单返现8%.
# total1 = 138.2
# total2 = 55.0
# total3 = 13.8
# total4 = 15.0
# return_money = (total1+total2+total3)*0.08
# print('返现的金额是:',return_money)
# num = random.randint(1,4)
# print('免单的是:',num)

# 身体的BMI指数: 体重(kg)/身高(m)的平方
# bmi_li = 81/1.87**2
# print(bmi_li)

# bmi_yin = 38/1.55**2
# print(bmi_yin)

