# 1、输入1个4位的正整数，计算出这个数每一位上数字的和和积
# num = int(input('请输入一个4位正整数：'))
# qian = num // 1000
# bai = num % 1000 // 100
# shi = num % 100 // 10
# ge = num % 10
# he = qian + bai + shi + ge
# ji = qian * bai * shi * ge
# print(he)
# print(ji)
# 2、猜数字：设计一个程序，程序内部设置一个数值，让用户猜这个值是多少,
# 打印用户输入的值,并比较内部设置的值和用户猜的值.
# num = '89'
# guess = input('请输入你猜的值:')
# print('用户猜测的结果是:',num==guess)
# a = 0
# while a < 3:
#     import random
#     num = random.randint(1, 10)
#     guess = int(input('猜一猜（请输入1-10的任意一个整数）：'))
#     if guess in range(1,11):
#         if num != guess :
#             print('嘿 猜错了')
#         else:
#             print('猜对了！好棒！')
#             break
#     else:
#         print('输入错误，请输入1-10的任意一个整数')
#         break
#     a += 1
# else:
#     print('机会用光了')

# 3.练习格式化输出个人名片。
# 在控制台依次提示用户输入：姓名，公司，职位，电话，邮箱,工资(小数点后保留2位,统一输出10位)。按照以下格式输出：
# **************************************************
# 公司名称 :
# 姓名(职位):
# 电话：
# 邮箱：
# 工资:
# **************************************************
# 要求打印三个人的名片.
company_name = '阿里巴巴'
employee_name = '张大'
phone = '13012341234'
email = 'zhang@qq.com'
salary = 24523.99
# print('''**************************************************
# 公司名称 : %s
# 姓名(职位): %s
# 电话：%s
# 邮箱：%s
# 工资: %10.2f
# **************************************************
# '''%(company_name,employee_name,phone,email,salary))

# print(f'''**************************************************
# 公司名称 : {company_name}
# 姓名(职位): {employee_name}
# 电话：{phone}
# 邮箱：{email}
# 工资: {salary}
# **************************************************
# ''')

# 01、40个梨分给3个班，分给一班20个，其余平均分给二班和三班，二班分到( )个。
# total = int(input('请输入要分的梨数:'))
# ban_1 = 20
# ban_2 = (total - ban_1) / 2
# print('二班分到%d个梨'%ban_2)
# 02、7年前，妈妈年龄是儿子的6倍，儿子今年12岁，妈妈今年( )岁。
# sun_age_now = 12
# mum_age_now = 6 * (sun_age_now - 7) + 7
# print('妈妈今年%d岁'%mum_age_now)
# 03，公交卡余额为43.8元，连续一个月30天，每天花1.5元坐公交车，一个月后余额为多钱？
# money = 43.8
# day_cost = 1.5
# day = int(input('请输入天数:'))
# cost = money - day_cost * day
# print('余额为：%.2f'%cost)


# 变量命名规则
# 变量名由数字、字母、下划线组成，且不能由数字开头
# 变量不能使用python关键字或者函数名
# 变量名应见名知义
